# CreateNotBeginsWithRule Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterFilterRuleFactory..::..CreateNotBeginsWithRule Method
ParameterFilterRuleFactory Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateNotBeginsWithRule(ElementId, String) | Creates a filter rule that determines whether strings from the document do not begin with a certain string value. |
| CreateNotBeginsWithRule(ElementId, String, Boolean) | **Obsolete.** Creates a filter rule that determines whether strings from the document do not begin with a certain string value. |

# See Also
ParameterFilterRuleFactory Class
ParameterFilterRuleFactory Members
Autodesk.Revit.DB Namespace